epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned short WDTCTL;  /* Watchdog Timer Control */

  struct
  {
    unsigned short WDTIS0        : 1;
    unsigned short WDTIS1        : 1;
    unsigned short WDTSSEL       : 1;
    unsigned short WDTCNTCL      : 1;
    unsigned short WDTTMSEL      : 1;
    unsigned short WDTNMI        : 1;
    unsigned short WDTNMIES      : 1;
    unsigned short WDTHOLD       : 1;
    unsigned short               : 8;
  } WDTCTL_bit;
} @ 0x0120;


enum {
  WDTIS0              = 0x0001,
  WDTIS1              = 0x0002,
  WDTSSEL             = 0x0004,
  WDTCNTCL            = 0x0008,
  WDTTMSEL            = 0x0010,
  WDTNMI              = 0x0020,
  WDTNMIES            = 0x0040,
  WDTHOLD             = 0x0080,
};


#define __MSP430_HAS_WDT__            /* Definition to show that Module is available */

#define WDTPW               (0x5A00)

/* WDT-interval times [1ms] coded with Bits 0-2 */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MDLY_32         (WDTPW+WDTTMSEL+WDTCNTCL)                         /* 32ms interval (default) */
#define WDT_MDLY_8          (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS0)                  /* 8ms      */
#define WDT_MDLY_0_5        (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1)                  /* 0.5ms    */
#define WDT_MDLY_0_064      (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS1+WDTIS0)           /* 0.064ms  */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ADLY_1000       (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL)                 /* 1000ms   */
#define WDT_ADLY_250        (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS0)          /* 250ms    */
#define WDT_ADLY_16         (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1)          /* 16ms     */
#define WDT_ADLY_1_9        (WDTPW+WDTTMSEL+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0)   /* 1.9ms    */
/* Watchdog mode -> reset after expired time */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MRST_32         (WDTPW+WDTCNTCL)                                  /* 32ms interval (default) */
#define WDT_MRST_8          (WDTPW+WDTCNTCL+WDTIS0)                           /* 8ms      */
#define WDT_MRST_0_5        (WDTPW+WDTCNTCL+WDTIS1)                           /* 0.5ms    */
#define WDT_MRST_0_064      (WDTPW+WDTCNTCL+WDTIS1+WDTIS0)                    /* 0.064ms  */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ARST_1000       (WDTPW+WDTCNTCL+WDTSSEL)                          /* 1000ms   */
#define WDT_ARST_250        (WDTPW+WDTCNTCL+WDTSSEL+WDTIS0)                   /* 250ms    */
#define WDT_ARST_16         (WDTPW+WDTCNTCL+WDTSSEL+WDTIS1)                   /* 16ms     */
#define WDT_ARST_1_9        (WDTPW+WDTCNTCL+WDTSSEL+WDTIS1+WDTIS0)            /* 1.9ms    */

/* INTERRUPT CONTROL */
/* These two bits are defined in the Special Function Registers */
/* #define WDTIE               0x01 */
/* #define WDTIFG              0x01 */


/*-------------------------------------------------------------------------
 *   Hardware Multiplier
 *-------------------------------------------------------------------------*/


 /* Multiply Unsigned/Operand 1 */
__no_init volatile unsigned short MPY @ 0x0130;


 /* Multiply Signed/Operand 1 */
__no_init volatile unsigned short MPYS @ 0x0132;


 /* Multiply Unsigned and Accumulate/Operand 1 */
__no_init volatile unsigned short MAC @ 0x0134;


 /* Multiply Signed and Accumulate/Operand 1 */
__no_init volatile unsigned short MACS @ 0x0136;


 /* Operand 2 */
__no_init volatile unsigned short OP2 @ 0x0138;


 /* Result Low Word */
__no_init volatile unsigned short RESLO @ 0x013A;


 /* Result High Word */
__no_init volatile unsigned short RESHI @ 0x013C;


 /* Sum Extend */
__no_init volatile unsigned __READ short SUMEXT @ 0x013E;


#define __MSP430_HAS_MPY__            /* Definition to show that Module is available */


/*-------------------------------------------------------------------------
 *   Digital I/O Port1/2
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned __READ char P1IN;  /* Port 1 Input */

  struct
  {
    unsigned __READ char P1IN_0  : 1;
    unsigned __READ char P1IN_1  : 1;
    unsigned __READ char P1IN_2  : 1;
    unsigned __READ char P1IN_3  : 1;
    unsigned __READ char P1IN_4  : 1;
    unsigned __READ char P1IN_5  : 1;
    unsigned __READ char P1IN_6  : 1;
    unsigned __READ char P1IN_7  : 1;
  } P1IN_bit;
} @ 0x0020;


enum {
  P1IN_0              = 0x0001,
  P1IN_1              = 0x0002,
  P1IN_2              = 0x0004,
  P1IN_3              = 0x0008,
  P1IN_4              = 0x0010,
  P1IN_5              = 0x0020,
  P1IN_6              = 0x0040,
  P1IN_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P1OUT;  /* Port 1 Output */

  struct
  {
    unsigned char P1OUT_0        : 1;
    unsigned char P1OUT_1        : 1;
    unsigned char P1OUT_2        : 1;
    unsigned char P1OUT_3        : 1;
    unsigned char P1OUT_4        : 1;
    unsigned char P1OUT_5        : 1;
    unsigned char P1OUT_6        : 1;
    unsigned char P1OUT_7        : 1;
  } P1OUT_bit;
} @ 0x0021;


enum {
  P1OUT_0             = 0x0001,
  P1OUT_1             = 0x0002,
  P1OUT_2             = 0x0004,
  P1OUT_3             = 0x0008,
  P1OUT_4             = 0x0010,
  P1OUT_5             = 0x0020,
  P1OUT_6             = 0x0040,
  P1OUT_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P1DIR;  /* Port 1 Direction */

  struct
  {
    unsigned char P1DIR_0        : 1;
    unsigned char P1DIR_1        : 1;
    unsigned char P1DIR_2        : 1;
    unsigned char P1DIR_3        : 1;
    unsigned char P1DIR_4        : 1;
    unsigned char P1DIR_5        : 1;
    unsigned char P1DIR_6        : 1;
    unsigned char P1DIR_7        : 1;
  } P1DIR_bit;
} @ 0x0022;


enum {
  P1DIR_0             = 0x0001,
  P1DIR_1             = 0x0002,
  P1DIR_2             = 0x0004,
  P1DIR_3             = 0x0008,
  P1DIR_4             = 0x0010,
  P1DIR_5             = 0x0020,
  P1DIR_6             = 0x0040,
  P1DIR_7             = 0x0080,
};


