epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned char P2IE;  /* Port 2 Interrupt Enable */

  struct
  {
    unsigned char P2IE_0         : 1;
    unsigned char P2IE_1         : 1;
    unsigned char P2IE_2         : 1;
    unsigned char P2IE_3         : 1;
    unsigned char P2IE_4         : 1;
    unsigned char P2IE_5         : 1;
    unsigned char P2IE_6         : 1;
    unsigned char P2IE_7         : 1;
  } P2IE_bit;
} @ 0x002D;


enum {
  P2IE_0              = 0x0001,
  P2IE_1              = 0x0002,
  P2IE_2              = 0x0004,
  P2IE_3              = 0x0008,
  P2IE_4              = 0x0010,
  P2IE_5              = 0x0020,
  P2IE_6              = 0x0040,
  P2IE_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P2SEL;  /* Port 2 Selection */

  struct
  {
    unsigned char P2SEL_0        : 1;
    unsigned char P2SEL_1        : 1;
    unsigned char P2SEL_2        : 1;
    unsigned char P2SEL_3        : 1;
    unsigned char P2SEL_4        : 1;
    unsigned char P2SEL_5        : 1;
    unsigned char P2SEL_6        : 1;
    unsigned char P2SEL_7        : 1;
  } P2SEL_bit;
} @ 0x002E;


enum {
  P2SEL_0             = 0x0001,
  P2SEL_1             = 0x0002,
  P2SEL_2             = 0x0004,
  P2SEL_3             = 0x0008,
  P2SEL_4             = 0x0010,
  P2SEL_5             = 0x0020,
  P2SEL_6             = 0x0040,
  P2SEL_7             = 0x0080,
};


#define __MSP430_HAS_PORT1__          /* Definition to show that Module is available */
#define __MSP430_HAS_PORT2__          /* Definition to show that Module is available */


/*-------------------------------------------------------------------------
 *   Digital I/O Port3/4
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned __READ char P3IN;  /* Port 3 Input */

  struct
  {
    unsigned __READ char P3IN_0  : 1;
    unsigned __READ char P3IN_1  : 1;
    unsigned __READ char P3IN_2  : 1;
    unsigned __READ char P3IN_3  : 1;
    unsigned __READ char P3IN_4  : 1;
    unsigned __READ char P3IN_5  : 1;
    unsigned __READ char P3IN_6  : 1;
    unsigned __READ char P3IN_7  : 1;
  } P3IN_bit;
} @ 0x0018;


enum {
  P3IN_0              = 0x0001,
  P3IN_1              = 0x0002,
  P3IN_2              = 0x0004,
  P3IN_3              = 0x0008,
  P3IN_4              = 0x0010,
  P3IN_5              = 0x0020,
  P3IN_6              = 0x0040,
  P3IN_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P3OUT;  /* Port 3 Output */

  struct
  {
    unsigned char P3OUT_0        : 1;
    unsigned char P3OUT_1        : 1;
    unsigned char P3OUT_2        : 1;
    unsigned char P3OUT_3        : 1;
    unsigned char P3OUT_4        : 1;
    unsigned char P3OUT_5        : 1;
    unsigned char P3OUT_6        : 1;
    unsigned char P3OUT_7        : 1;
  } P3OUT_bit;
} @ 0x0019;


enum {
  P3OUT_0             = 0x0001,
  P3OUT_1             = 0x0002,
  P3OUT_2             = 0x0004,
  P3OUT_3             = 0x0008,
  P3OUT_4             = 0x0010,
  P3OUT_5             = 0x0020,
  P3OUT_6             = 0x0040,
  P3OUT_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P3DIR;  /* Port 3 Direction */

  struct
  {
    unsigned char P3DIR_0        : 1;
    unsigned char P3DIR_1        : 1;
    unsigned char P3DIR_2        : 1;
    unsigned char P3DIR_3        : 1;
    unsigned char P3DIR_4        : 1;
    unsigned char P3DIR_5        : 1;
    unsigned char P3DIR_6        : 1;
    unsigned char P3DIR_7        : 1;
  } P3DIR_bit;
} @ 0x001A;


enum {
  P3DIR_0             = 0x0001,
  P3DIR_1             = 0x0002,
  P3DIR_2             = 0x0004,
  P3DIR_3             = 0x0008,
  P3DIR_4             = 0x0010,
  P3DIR_5             = 0x0020,
  P3DIR_6             = 0x0040,
  P3DIR_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P3SEL;  /* Port 3 Selection */

  struct
  {
    unsigned char P3SEL_0        : 1;
    unsigned char P3SEL_1        : 1;
    unsigned char P3SEL_2        : 1;
    unsigned char P3SEL_3        : 1;
    unsigned char P3SEL_4        : 1;
    unsigned char P3SEL_5        : 1;
    unsigned char P3SEL_6        : 1;
    unsigned char P3SEL_7        : 1;
  } P3SEL_bit;
} @ 0x001B;


enum {
  P3SEL_0             = 0x0001,
  P3SEL_1             = 0x0002,
  P3SEL_2             = 0x0004,
  P3SEL_3             = 0x0008,
  P3SEL_4             = 0x0010,
  P3SEL_5             = 0x0020,
  P3SEL_6             = 0x0040,
  P3SEL_7             = 0x0080,
};


__no_init volatile union
{
  unsigned __READ char P4IN;  /* Port 4 Input */

  struct
  {
    unsigned __READ char P4IN_0  : 1;
    unsigned __READ char P4IN_1  : 1;
    unsigned __READ char P4IN_2  : 1;
    unsigned __READ char P4IN_3  : 1;
    unsigned __READ char P4IN_4  : 1;
    unsigned __READ char P4IN_5  : 1;
    unsigned __READ char P4IN_6  : 1;
    unsigned __READ char P4IN_7  : 1;
  } P4IN_bit;
} @ 0x001C;


enum {
  P4IN_0              = 0x0001,
  P4IN_1              = 0x0002,
  P4IN_2              = 0x0004,
  P4IN_3              = 0x0008,
  P4IN_4              = 0x0010,
  P4IN_5              = 0x0020,
  P4IN_6              = 0x0040,
  P4IN_7              = 0x0080,
};


__no_init volatile union
{
  unsigned char P4OUT;  /* Port 4 Output */

  struct
  {
    unsigned char P4OUT_0        : 1;
    unsigned char P4OUT_1        : 1;
    unsigned char P4OUT_2        : 1;
    unsigned char P4OUT_3        : 1;
    unsigned char P4OUT_4        : 1;
    unsigned char P4OUT_5        : 1;
    unsigned char P4OUT_6        : 1;
    unsigned char P4OUT_7        : 1;
  } P4OUT_bit;
} @ 0x001D;


enum {
  P4OUT_0             = 0x0001,
  P4OUT_1             = 0x0002,
  P4OUT_2             = 0x0004,
  P4OUT_3             = 0x0008,
  P4OUT_4             = 0x0010,
  P4OUT_5             = 0x0020,
  P4OUT_6             = 0x0040,
  P4OUT_7             = 0x0080,
};


__no_init volatile union
{
  unsigned char P4DIR;  /* Port 4 Direction */

  struct
  {
    unsigned char P4DIR_0        : 1;
    unsigned char P4DIR_1        : 1;
    unsigned char P4DIR_2        : 1;
    unsigned char P4DIR_3        : 1;
    unsigned char P4DIR_4        : 1;
    unsigned char P4DIR_5        : 1;
    unsigned char P4DIR_6        : 1;
    unsigned char P4DIR_7        : 1;
  } P4DIR_bit;
} @ 0x001E;


enum {
  P4DIR_0             = 0x0001,
  P4DIR_1             = 0x0002,
  P4DIR_2             = 0x0004,
  P4DIR_3             = 0x0008,
  P4DIR_4             = 0x0010,
  P4DIR_5             = 0x0020,
  P4DIR_6             = 0x0040,
  P4DIR_7             = 0x0080,
};


