epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned char U0CTL;  /* USART 0 Control */

  union
  {
    struct
    {
      unsigned char SWRST          : 1;  /* USART Software Reset */
      unsigned char MM             : 1;  /* Master Mode off/on */
      unsigned char SYNC           : 1;  /* UART / SPI mode */
      unsigned char LISTEN         : 1;  /* Listen mode */
      unsigned char CHAR2          : 1;  /* Data 0:7-bits / 1:8-bits */
      unsigned char SPB            : 1;  /* Stop Bits 0:one / 1: two */
      unsigned char PEV            : 1;  /* Parity 0:odd / 1:even */
      unsigned char PENA           : 1;  /* Parity enable */
    };
    struct
    {
      unsigned char I2CEN          : 1;  /* I2C enable */
      unsigned char MST            : 1;  /* I2C master */
      unsigned char                : 2;
      unsigned char XA             : 1;  /* I2C extended addressing */
      unsigned char I2C            : 1;  /* USART I2C */
      unsigned char TXDMAEN        : 1;  /* Transmit DMA enable */
      unsigned char RXDMAEN        : 1;  /* Receive DMA enable */
    };
  } U0CTL_bit;
} @ 0x0070;

#define U0CTL_I2C U0CTL  /*  */

enum {
  SWRST               = 0x0001,
  MM                  = 0x0002,
  SYNC                = 0x0004,
  LISTEN              = 0x0008,
  CHAR2               = 0x0010,
  SPB                 = 0x0020,
  PEV                 = 0x0040,
  PENA                = 0x0080,
  I2CEN               = 0x0001,
  MST                 = 0x0002,
  XA                  = 0x0010,
  I2C                 = 0x0020,
  TXDMAEN             = 0x0040,
  RXDMAEN             = 0x0080,
};


__no_init volatile union
{
  unsigned char U0TCTL;  /* USART 0 Transmit Control */

  union
  {
    struct
    {
      unsigned char TXEPT          : 1;  /* TX Buffer empty */
      unsigned char STC            : 1;  /* SPI: STC enable 0:on / 1:off */
      unsigned char TXWAKE         : 1;  /* TX Wake up mode */
      unsigned char URXSE          : 1;  /* Receive Start edge select */
      unsigned char SSEL0          : 1;  /* Clock Source Select 0 */
      unsigned char SSEL1          : 1;  /* Clock Source Select 1 */
      unsigned char CKPL           : 1;  /* Clock Polarity */
      unsigned char CKPH           : 1;  /* SPI: Clock Phase */
    };
    struct
    {
      unsigned char I2CSTT         : 1;  /* Start bit */
      unsigned char I2CSTP         : 1;  /* Stop bit */
      unsigned char I2CSTB         : 1;  /* Start byte mode */
      unsigned char I2CTRX         : 1;  /* Transmit */
      unsigned char I2CSSEL0       : 1;  /* Clock select bit 0 */
      unsigned char I2CSSEL1       : 1;  /* Clock select bit 1 */
      unsigned char I2CRM          : 1;  /* Repeat mode */
      unsigned char I2CWORD        : 1;  /* Word data mode */
    };
  } U0TCTL_bit;
} @ 0x0071;

#define I2CTCTL U0TCTL  /* I2C Transfer Control */

enum {
  TXEPT               = 0x0001,
  STC                 = 0x0002,
  TXWAKE              = 0x0004,
  URXSE               = 0x0008,
  SSEL0               = 0x0010,
  SSEL1               = 0x0020,
  CKPL                = 0x0040,
  CKPH                = 0x0080,
  I2CSTT              = 0x0001,
  I2CSTP              = 0x0002,
  I2CSTB              = 0x0004,
  I2CTRX              = 0x0008,
  I2CSSEL0            = 0x0010,
  I2CSSEL1            = 0x0020,
  I2CRM               = 0x0040,
  I2CWORD             = 0x0080,
};


__no_init volatile union
{
  unsigned char U0RCTL;  /* USART 0 Receive Control */

  union
  {
    struct
    {
      unsigned char RXERR          : 1;  /* RX Error Error */
      unsigned char RXWAKE         : 1;  /* RX Wake up detect */
      unsigned char URXWIE         : 1;  /* RX Wake up interrupt enable */
      unsigned char URXEIE         : 1;  /* RX Error interrupt enable */
      unsigned char BRK            : 1;  /* Break detected */
      unsigned char OE             : 1;  /* Overrun Error */
      unsigned char PE             : 1;  /* Parity Error */
      unsigned char FE             : 1;  /* Frame Error */
    };
    struct
    {
      unsigned __READ char I2CBB   : 1;  /* Bus busy */
      unsigned __READ char I2CRXOVR : 1;  /* Receiver overrun */
      unsigned __READ char I2CTXUDF : 1;  /* Transmit underflow */
      unsigned __READ char I2CSBD  : 1;  /* Received byte */
      unsigned __READ char I2CSCLLOW : 1;  /* SCL being held low */
      unsigned __READ char I2CBUSY : 1;  /* I2C Busy Flag */
    };
  } U0RCTL_bit;
} @ 0x0072;

#define I2CDCTL U0RCTL  /* I2C Data Control */

enum {
  RXERR               = 0x0001,
  RXWAKE              = 0x0002,
  URXWIE              = 0x0004,
  URXEIE              = 0x0008,
  BRK                 = 0x0010,
  OE                  = 0x0020,
  PE                  = 0x0040,
  FE                  = 0x0080,
  I2CBB               = 0x0001,
  I2CRXOVR            = 0x0002,
  I2CTXUDF            = 0x0004,
  I2CSBD              = 0x0008,
  I2CSCLLOW           = 0x0010,
  I2CBUSY             = 0x0020,
};


 /* USART 0 Modulation Control */
__no_init volatile unsigned char U0MCTL @ 0x0073;

#define I2CPSC U0MCTL  /* I2C Pre-scaler */

 /* USART 0 Baud Rate 0 */
__no_init volatile unsigned char U0BR0 @ 0x0074;

#define I2CSCLH U0BR0  /* I2C SCL High */

 /* USART 0 Baud Rate 1 */
__no_init volatile unsigned char U0BR1 @ 0x0075;

#define I2CSCLL U0BR1  /* I2C SCL Low */

__no_init union
{
  struct
  {
    volatile __READ unsigned char     U0RXBUF;
    volatile unsigned char            U0TXBUF;

  };
  volatile unsigned short             I2CDRW;
  volatile unsigned char              I2CDRB;
} @ 0x0076;


#define __MSP430_HAS_UART0__          /* Definition to show that Module is available */

/* Alternate register names */
#define UCTL0               U0CTL     /* USART 0 Control */
#define UTCTL0              U0TCTL    /* USART 0 Transmit Control */
#define URCTL0              U0RCTL    /* USART 0 Receive Control */
#define UMCTL0              U0MCTL    /* USART 0 Modulation Control */
#define UBR00               U0BR0     /* USART 0 Baud Rate 0 */
#define UBR10               U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF0              U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF0              U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL0_              U0CTL     /* USART 0 Control */
#define UTCTL0_             U0TCTL    /* USART 0 Transmit Control */
#define URCTL0_             U0RCTL    /* USART 0 Receive Control */
#define UMCTL0_             U0MCTL    /* USART 0 Modulation Control */
#define UBR00_              U0BR0     /* USART 0 Baud Rate 0 */
#define UBR10_              U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF0_             U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF0_             U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL_0              U0CTL     /* USART 0 Control */
#define UTCTL_0             U0TCTL    /* USART 0 Transmit Control */
#define URCTL_0             U0RCTL    /* USART 0 Receive Control */
#define UMCTL_0             U0MCTL    /* USART 0 Modulation Control */
#define UBR0_0              U0BR0     /* USART 0 Baud Rate 0 */
#define UBR1_0              U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF_0             U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF_0             U0TXBUF   /* USART 0 Transmit Buffer */
#define UCTL_0_             U0CTL     /* USART 0 Control */
#define UTCTL_0_            U0TCTL    /* USART 0 Transmit Control */
#define URCTL_0_            U0RCTL    /* USART 0 Receive Control */
#define UMCTL_0_            U0MCTL    /* USART 0 Modulation Control */
#define UBR0_0_             U0BR0     /* USART 0 Baud Rate 0 */
#define UBR1_0_             U0BR1     /* USART 0 Baud Rate 1 */
#define RXBUF_0_            U0RXBUF   /* USART 0 Receive Buffer */
#define TXBUF_0_            U0TXBUF   /* USART 0 Transmit Buffer */


/*-------------------------------------------------------------------------
 *   I2C
 *-------------------------------------------------------------------------*/


