epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned char I2CIE;  /* I2C Interrupt Enable */

  struct
  {
    unsigned char ALIE           : 1;  /* Arbitration lost */
    unsigned char NACKIE         : 1;  /* No acknowledge */
    unsigned char OAIE           : 1;  /* Own address */
    unsigned char ARDYIE         : 1;  /* Access ready (opeation complete) */
    unsigned char RXRDYIE        : 1;  /* Receive ready (data received) */
    unsigned char TXRDYIE        : 1;  /* Transmit ready (transmit register empty) */
    unsigned char GCIE           : 1;  /* General call */
    unsigned char STTIE          : 1;  /* Start condition */
  } I2CIE_bit;
} @ 0x0050;


enum {
  ALIE                = 0x0001,
  NACKIE              = 0x0002,
  OAIE                = 0x0004,
  ARDYIE              = 0x0008,
  RXRDYIE             = 0x0010,
  TXRDYIE             = 0x0020,
  GCIE                = 0x0040,
  STTIE               = 0x0080,
};


__no_init volatile union
{
  unsigned char I2CIFG;  /* I2C Interrupt Flag */

  struct
  {
    unsigned char ALIFG          : 1;  /* Arbitration lost */
    unsigned char NACKIFG        : 1;  /* No acknowledge */
    unsigned char OAIFG          : 1;  /* Own address */
    unsigned char ARDYIFG        : 1;  /* Access ready (opeation complete) */
    unsigned char RXRDYIFG       : 1;  /* Receive ready (data received) */
    unsigned char TXRDYIFG       : 1;  /* Transmit ready (transmit register empty) */
    unsigned char GCIFG          : 1;  /* General call */
    unsigned char STTIFG         : 1;  /* Start condition */
  } I2CIFG_bit;
} @ 0x0051;


enum {
  ALIFG               = 0x0001,
  NACKIFG             = 0x0002,
  OAIFG               = 0x0004,
  ARDYIFG             = 0x0008,
  RXRDYIFG            = 0x0010,
  TXRDYIFG            = 0x0020,
  GCIFG               = 0x0040,
  STTIFG              = 0x0080,
};


 /* I2C Data Count */
__no_init volatile unsigned char I2CNDAT @ 0x0052;


 /* I2C Own Address */
__no_init volatile unsigned short I2COA @ 0x0118;


 /* I2C Slave Address */
__no_init volatile unsigned short I2CSA @ 0x011A;


 /* I2C Interrupt Vector */
__no_init volatile unsigned __READ short I2CIV @ 0x011C;


#define __MSP430_HAS_I2C__           /* Definition to show that Module is available */

#define I2CTCTL_          U0TCTL     /* I2C Transfer Control */

#define I2CSSEL_0        (0*0x10u)   /* I2C clock select 0: UCLK */
#define I2CSSEL_1        (1*0x10u)   /* I2C clock select 1: ACLK */
#define I2CSSEL_2        (2*0x10u)   /* I2C clock select 2: SMCLK */
#define I2CSSEL_3        (3*0x10u)   /* I2C clock select 3: SMCLK */

#define I2CMM_0          (0x00)      	 /* Master mode 0 */
#define I2CMM_1          (I2CSTT)    	 /* Master mode 1 */
#define I2CMM_2          (I2CSTP+I2CSTT) /* Master mode 2 */
#define I2CMM_3          (I2CRM+I2CSTT)  /* Master mode 3 */
#define I2CMM_4          (I2CSTP)    	 /* Master mode 4 */

#define I2CDCTL_          USART0     /* I2C Data Control */

#define I2CPSC            U0MCTL     /* I2C Pre-scaler */
#define I2CPSC_           U0MCTL     /* I2C Pre-scaler */
#define I2CSCLH           U0BR0      /* I2C SCL High */
#define I2CSCLH_          U0BR0      /* I2C SCL High */
#define I2CSCLL           U0BR1      /* I2C SCL Low */
#define I2CSCLL_          U0BR1      /* I2C SCL Low */

#define I2CDRB_           I2CDRB     /* I2C Data for Byte access */
#define I2CDRW_           I2CDRW     /* I2C Data for Word access */

#define I2CIV_NONE       (0x0000)    /* I2C interrupt vector: No interrupt pending */
#define I2CIV_AL         (0x0002)    /* I2C interrupt vector: Arbitration lost (ALIFG) */
#define I2CIV_NACK       (0x0004)    /* I2C interrupt vector: No acknowledge (NACKIFG) */
#define I2CIV_OA         (0x0006)    /* I2C interrupt vector: Own address (OAIFG) */
#define I2CIV_ARDY       (0x0008)    /* I2C interrupt vector: Access ready (ARDYIFG) */
#define I2CIV_RXRDY      (0x000A)    /* I2C interrupt vector: Receive ready (RXRDYIFG) */
#define I2CIV_TXRDY      (0x000C)    /* I2C interrupt vector: Transmit ready (TXRDYIFG) */
#define I2CIV_GC         (0x000E)    /* I2C interrupt vector: General call (GCIFG) */
#define I2CIV_STT        (0x0010)    /* I2C interrupt vector: Start condition (STTIFG) */


/*-------------------------------------------------------------------------
 *   USART 1
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char U1CTL;  /* USART 1 Control */

  struct
  {
    unsigned char SWRST          : 1;  /* USART Software Reset */
    unsigned char MM             : 1;  /* Master Mode off/on */
    unsigned char SYNC           : 1;  /* UART / SPI mode */
    unsigned char LISTEN         : 1;  /* Listen mode */
    unsigned char CHAR2          : 1;  /* Data 0:7-bits / 1:8-bits */
    unsigned char SPB            : 1;  /* Stop Bits 0:one / 1: two */
    unsigned char PEV            : 1;  /* Parity 0:odd / 1:even */
    unsigned char PENA           : 1;  /* Parity enable */
  } U1CTL_bit;
} @ 0x0078;




__no_init volatile union
{
  unsigned char U1TCTL;  /* USART 1 Transmit Control */

  struct
  {
    unsigned char TXEPT          : 1;  /* TX Buffer empty */
    unsigned char STC            : 1;  /* SPI: STC enable 0:on / 1:off */
    unsigned char TXWAKE         : 1;  /* TX Wake up mode */
    unsigned char URXSE          : 1;  /* Receive Start edge select */
    unsigned char SSEL0          : 1;  /* Clock Source Select 0 */
    unsigned char SSEL1          : 1;  /* Clock Source Select 1 */
    unsigned char CKPL           : 1;  /* Clock Polarity */
    unsigned char CKPH           : 1;  /* SPI: Clock Phase */
  } U1TCTL_bit;
} @ 0x0079;




__no_init volatile union
{
  unsigned char U1RCTL;  /* USART 1 Receive Control */

  struct
  {
    unsigned char RXERR          : 1;  /* RX Error Error */
    unsigned char RXWAKE         : 1;  /* RX Wake up detect */
    unsigned char URXWIE         : 1;  /* RX Wake up interrupt enable */
    unsigned char URXEIE         : 1;  /* RX Error interrupt enable */
    unsigned char BRK            : 1;  /* Break detected */
    unsigned char OE             : 1;  /* Overrun Error */
    unsigned char PE             : 1;  /* Parity Error */
    unsigned char FE             : 1;  /* Frame Error */
  } U1RCTL_bit;
} @ 0x007A;




 /* USART 1 Modulation Control */
__no_init volatile unsigned char U1MCTL @ 0x007B;


 /* USART 1 Baud Rate 0 */
__no_init volatile unsigned char U1BR0 @ 0x007C;


