epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned short TACCTL2;  /* Timer A Capture/Compare Control 2 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short               : 1;
    unsigned short SCCI          : 1;  /* Latched capture signal (read) */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TACCTL2_bit;
} @ 0x0166;




 /* Timer A */
__no_init volatile unsigned short TAR @ 0x0170;


 /* Timer A Capture/Compare 0 */
__no_init volatile unsigned short TACCR0 @ 0x0172;


 /* Timer A Capture/Compare 1 */
__no_init volatile unsigned short TACCR1 @ 0x0174;


 /* Timer A Capture/Compare 2 */
__no_init volatile unsigned short TACCR2 @ 0x0176;


#define __MSP430_HAS_TA3__         /* Definition to show that Module is available */

#define MC_0            (0*0x10u)  /* Timer A mode control: 0 - Stop */
#define MC_1            (1*0x10u)  /* Timer A mode control: 1 - Up to CCR0 */
#define MC_2            (2*0x10u)  /* Timer A mode control: 2 - Continous up */
#define MC_3            (3*0x10u)  /* Timer A mode control: 3 - Up/Down */
#define ID_0            (0*0x40u)  /* Timer A input divider: 0 - /1 */
#define ID_1            (1*0x40u)  /* Timer A input divider: 1 - /2 */
#define ID_2            (2*0x40u)  /* Timer A input divider: 2 - /4 */
#define ID_3            (3*0x40u)  /* Timer A input divider: 3 - /8 */
#define TASSEL_0        (0*0x100u) /* Timer A clock source select: 0 - TACLK */
#define TASSEL_1        (1*0x100u) /* Timer A clock source select: 1 - ACLK  */
#define TASSEL_2        (2*0x100u) /* Timer A clock source select: 2 - SMCLK */
#define TASSEL_3        (3*0x100u) /* Timer A clock source select: 3 - INCLK */

#define OUTMOD_0        (0*0x20u)  /* PWM output mode: 0 - output only */
#define OUTMOD_1        (1*0x20u)  /* PWM output mode: 1 - set */
#define OUTMOD_2        (2*0x20u)  /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3        (3*0x20u)  /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4        (4*0x20u)  /* PWM output mode: 4 - toggle */
#define OUTMOD_5        (5*0x20u)  /* PWM output mode: 5 - Reset */
#define OUTMOD_6        (6*0x20u)  /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7        (7*0x20u)  /* PWM output mode: 7 - PWM reset/set */
#define CCIS_0          (0*0x1000u) /* Capture input select: 0 - CCIxA */
#define CCIS_1          (1*0x1000u) /* Capture input select: 1 - CCIxB */
#define CCIS_2          (2*0x1000u) /* Capture input select: 2 - GND */
#define CCIS_3          (3*0x1000u) /* Capture input select: 3 - Vcc */
#define CM_0            (0*0x4000u) /* Capture mode: 0 - disabled */
#define CM_1            (1*0x4000u) /* Capture mode: 1 - pos. edge */
#define CM_2            (2*0x4000u) /* Capture mode: 1 - neg. edge */
#define CM_3            (3*0x4000u) /* Capture mode: 1 - both edges */

/* Alternate register names */
#define CCTL0           TACCTL0   /* Timer A Capture/Compare Control 0 */
#define CCTL1           TACCTL1   /* Timer A Capture/Compare Control 1 */
#define CCTL2           TACCTL2   /* Timer A Capture/Compare Control 2 */
#define CCR0            TACCR0    /* Timer A Capture/Compare 0 */
#define CCR1            TACCR1    /* Timer A Capture/Compare 1 */
#define CCR2            TACCR2    /* Timer A Capture/Compare 2 */
#define CCTL0_          TACCTL0   /* Timer A Capture/Compare Control 0 */
#define CCTL1_          TACCTL1   /* Timer A Capture/Compare Control 1 */
#define CCTL2_          TACCTL2   /* Timer A Capture/Compare Control 2 */
#define CCR0_           TACCR0    /* Timer A Capture/Compare 0 */
#define CCR1_           TACCR1    /* Timer A Capture/Compare 1 */
#define CCR2_           TACCR2    /* Timer A Capture/Compare 2 */


/*-------------------------------------------------------------------------
 *   Timer B7
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned __READ short TBIV;  /* Timer B Interrupt Vector Word */

  struct
  {
    unsigned __READ short        : 1;
    unsigned __READ short IRQVEC : 3;
    unsigned __READ short        : 12;
  } TBIV_bit;
} @ 0x011E;




__no_init volatile union
{
  unsigned short TBCTL;  /* Timer B Control */

  struct
  {
    unsigned short TBIFG         : 1;  /* Timer B interrupt flag */
    unsigned short TBIE          : 1;  /* Timer B interrupt enable */
    unsigned short TBCLR         : 1;  /* Timer B counter clear */
    unsigned short               : 1;
    unsigned short TBMC          : 2;  /* Timer B mode control 1 */
    unsigned short TBID          : 2;  /* Timer B clock input divider */
    unsigned short TBSSEL        : 2;  /* Timer B clock source select */
    unsigned short               : 1;
    unsigned short TBCNTL        : 2;  /* Timer B Control */
    unsigned short TBCLGRP       : 2;  /* Timer B Compare latch load group */
    unsigned short               : 1;
  } TBCTL_bit;
} @ 0x0180;


enum {
  TBIFG               = 0x0001,
  TBIE                = 0x0002,
  TBCLR               = 0x0004,
  TBMC                = 0x0020,
  TBID                = 0x0080,
  TBSSEL              = 0x0200,
  TBCNTL              = 0x1000,
  TBCLGRP             = 0x4000,
};


__no_init volatile union
{
  unsigned short TBCCTL0;  /* Timer B Capture/Compare Control 0 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL0_bit;
} @ 0x0182;


enum {
  CLLD                = 0x0400,
};


