epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned short TBCCTL1;  /* Timer B Capture/Compare Control 1 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL1_bit;
} @ 0x0184;




__no_init volatile union
{
  unsigned short TBCCTL2;  /* Timer B Capture/Compare Control 2 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL2_bit;
} @ 0x0186;




__no_init volatile union
{
  unsigned short TBCCTL3;  /* Timer B Capture/Compare Control 3 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL3_bit;
} @ 0x0188;




__no_init volatile union
{
  unsigned short TBCCTL4;  /* Timer B Capture/Compare Control 4 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL4_bit;
} @ 0x018A;




__no_init volatile union
{
  unsigned short TBCCTL5;  /* Timer B Capture/Compare Control 5 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL5_bit;
} @ 0x018C;




__no_init volatile union
{
  unsigned short TBCCTL6;  /* Timer B Capture/Compare Control 6 */

  struct
  {
    unsigned short CCIFG         : 1;  /* Capture/compare interrupt flag */
    unsigned short COV           : 1;  /* Capture/compare overflow flag */
    unsigned short OUT           : 1;  /* PWM Output signal if output mode 0 */
    unsigned short CCI           : 1;  /* Capture input signal (read) */
    unsigned short CCIE          : 1;  /* Capture/compare interrupt enable */
    unsigned short OUTMOD        : 3;  /* Output mode 0 */
    unsigned short CAP           : 1;  /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD          : 2;  /* Compare latch load source */
    unsigned short SCS           : 1;  /* Capture sychronize */
    unsigned short CCIS          : 2;  /* Capture input select */
    unsigned short CM            : 2;  /* Capture mode */
  } TBCCTL6_bit;
} @ 0x018E;




 /* Timer B */
__no_init volatile unsigned short TBR @ 0x0190;


 /* Timer B Capture/Compare 0 */
__no_init volatile unsigned short TBCCR0 @ 0x0192;


 /* Timer B Capture/Compare 1 */
__no_init volatile unsigned short TBCCR1 @ 0x0194;


 /* Timer B Capture/Compare 2 */
__no_init volatile unsigned short TBCCR2 @ 0x0196;


 /* Timer B Capture/Compare 3 */
__no_init volatile unsigned short TBCCR3 @ 0x0198;


 /* Timer B Capture/Compare 4 */
__no_init volatile unsigned short TBCCR4 @ 0x019A;


