epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
 /* Timer B Capture/Compare 5 */
__no_init volatile unsigned short TBCCR5 @ 0x019C;


 /* Timer B Capture/Compare 6 */
__no_init volatile unsigned short TBCCR6 @ 0x019E;


#define __MSP430_HAS_TB7__            /* Definition to show that Module is available */

#define TBSSEL_0      (0*0x0100u)  /* Clock Source: TBCLK */
#define TBSSEL_1      (1*0x0100u)  /* Clock Source: ACLK  */
#define TBSSEL_2      (2*0x0100u)  /* Clock Source: SMCLK */
#define TBSSEL_3      (3*0x0100u)  /* Clock Source: INCLK */
#define CNTL_0        (0*0x0800u)  /* Counter lenght: 16 bit */
#define CNTL_1        (1*0x0800u)  /* Counter lenght: 12 bit */
#define CNTL_2        (2*0x0800u)  /* Counter lenght: 10 bit */
#define CNTL_3        (3*0x0800u)  /* Counter lenght:  8 bit */
#define SHR_0         (0*0x2000u)  /* Timer B Group: 0 - individually */
#define SHR_1         (1*0x2000u)  /* Timer B Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define SHR_2         (2*0x2000u)  /* Timer B Group: 2 - 2 groups (1-3, 4-6)*/
#define SHR_3         (3*0x2000u)  /* Timer B Group: 3 - 1 group (all) */
#define TBCLGRP_0     (0*0x2000u)  /* Timer B Group: 0 - individually */
#define TBCLGRP_1     (1*0x2000u)  /* Timer B Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define TBCLGRP_2     (2*0x2000u)  /* Timer B Group: 2 - 2 groups (1-3, 4-6)*/
#define TBCLGRP_3     (3*0x2000u)  /* Timer B Group: 3 - 1 group (all) */

#define CLLD1         (0x0400)     /* Compare latch load source 1 */
#define CLLD0         (0x0200)     /* Compare latch load source 0 */

#define SLSHR1        (0x0400)     /* Compare latch load source 1 */
#define SLSHR0        (0x0200)     /* Compare latch load source 0 */

#define SLSHR_0       (0*0x0200u)  /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1       (1*0x0200u)  /* Compare latch load sourec : 1 - TBR counts to 0 */
#define SLSHR_2       (2*0x0200u)  /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3       (3*0x0200u)  /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

#define CLLD_0        (0*0x0200u)  /* Compare latch load sourec : 0 - immediate */
#define CLLD_1        (1*0x0200u)  /* Compare latch load sourec : 1 - TBR counts to 0 */
#define CLLD_2        (2*0x0200u)  /* Compare latch load sourec : 2 - up/down */
#define CLLD_3        (3*0x0200u)  /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */


/*-------------------------------------------------------------------------
 *   Basic Clock Module
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned char DCOCTL;  /* DCO Clock Frequency Control */

  struct
  {
    unsigned char MOD0           : 1;  /* Modulation Bit 0 */
    unsigned char MOD1           : 1;  /* Modulation Bit 1 */
    unsigned char MOD2           : 1;  /* Modulation Bit 2 */
    unsigned char MOD3           : 1;  /* Modulation Bit 3 */
    unsigned char MOD4           : 1;  /* Modulation Bit 4 */
    unsigned char DCO0           : 1;  /* DCO Select Bit 0 */
    unsigned char DCO1           : 1;  /* DCO Select Bit 1 */
    unsigned char DCO2           : 1;  /* DCO Select Bit 2 */
  } DCOCTL_bit;
} @ 0x0056;


enum {
  MOD0                = 0x0001,
  MOD1                = 0x0002,
  MOD2                = 0x0004,
  MOD3                = 0x0008,
  MOD4                = 0x0010,
  DCO0                = 0x0020,
  DCO1                = 0x0040,
  DCO2                = 0x0080,
};


__no_init volatile union
{
  unsigned char BCSCTL1;  /* Basic Clock System Control 1 */

  struct
  {
    unsigned char RSEL0          : 1;  /* Range Select Bit 0 */
    unsigned char RSEL1          : 1;  /* Range Select Bit 1 */
    unsigned char RSEL2          : 1;  /* Range Select Bit 2 */
    unsigned char XT5V           : 1;  /* XT5V should always be reset */
    unsigned char DIVA0          : 1;  /* ACLK Divider 0 */
    unsigned char DIVA1          : 1;  /* ACLK Divider 1 */
    unsigned char XTS            : 1;  /* LFXTCLK 0:Low Freq. / 1: High Freq. */
    unsigned char XT2OFF         : 1;  /* Enable XT2CLK */
  } BCSCTL1_bit;
} @ 0x0057;


enum {
  RSEL0               = 0x0001,
  RSEL1               = 0x0002,
  RSEL2               = 0x0004,
  XT5V                = 0x0008,
  DIVA0               = 0x0010,
  DIVA1               = 0x0020,
  XTS                 = 0x0040,
  XT2OFF              = 0x0080,
};


__no_init volatile union
{
  unsigned char BCSCTL2;  /* Basic Clock System Control 2 */

  struct
  {
    unsigned char DCOR           : 1;  /* Enable External Resistor : 1 */
    unsigned char DIVS0          : 1;  /* SMCLK Divider 0 */
    unsigned char DIVS1          : 1;  /* SMCLK Divider 1 */
    unsigned char SELS           : 1;  /* SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK */
    unsigned char DIVM0          : 1;  /* CLK Divider 0 */
    unsigned char DIVM1          : 1;  /* CLK Divider 1 */
    unsigned char SELM0          : 1;  /* MCLK Source Select 0 */
    unsigned char SELM1          : 1;  /* MCLK Source Select 1 */
  } BCSCTL2_bit;
} @ 0x0058;


enum {
  DCOR                = 0x0001,
  DIVS0               = 0x0002,
  DIVS1               = 0x0004,
  SELS                = 0x0008,
  DIVM0               = 0x0010,
  DIVM1               = 0x0020,
  SELM0               = 0x0040,
  SELM1               = 0x0080,
};


#define __MSP430_HAS_BASIC_CLOCK__ 	/* Definition to show that Module is available */

#define DIVA_0           (0x00)   	/* ACLK Divider 0: /1 */
#define DIVA_1           (0x10)   	/* ACLK Divider 1: /2 */
#define DIVA_2           (0x20)   	/* ACLK Divider 2: /4 */
#define DIVA_3           (0x30)   	/* ACLK Divider 3: /8 */

#define DIVS_0           (0x00)   	/* SMCLK Divider 0: /1 */
#define DIVS_1           (0x02)   	/* SMCLK Divider 1: /2 */
#define DIVS_2           (0x04)   	/* SMCLK Divider 2: /4 */
#define DIVS_3           (0x06)   	/* SMCLK Divider 3: /8 */

#define DIVM_0           (0x00)   	/* MCLK Divider 0: /1 */
#define DIVM_1           (0x10)   	/* MCLK Divider 1: /2 */
#define DIVM_2           (0x20)   	/* MCLK Divider 2: /4 */
#define DIVM_3           (0x30)   	/* MCLK Divider 3: /8 */

#define SELM_0           (0x00)   	/* MCLK Source Select 0: DCOCLK */
#define SELM_1           (0x40)   	/* MCLK Source Select 1: DCOCLK */
#define SELM_2           (0x80)   	/* MCLK Source Select 2: XT2CLK/LFXTCLK */
#define SELM_3           (0xC0)   	/* MCLK Source Select 3: LFXTCLK */


/*-------------------------------------------------------------------------
 *   Comparator A
 *-------------------------------------------------------------------------*/


