epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned char CACTL1;  /* Comparator A Control 1 */

  struct
  {
    unsigned char CAIFG          : 1;  /* Comp. A Interrupt Flag */
    unsigned char CAIE           : 1;  /* Comp. A Interrupt Enable */
    unsigned char CAIES          : 1;  /* Comp. A Int. Edge Select: 0:rising / 1:falling */
    unsigned char CAON           : 1;  /* Comp. A enable */
    unsigned char CAREF0         : 1;  /* Comp. A Internal Reference Select 0 */
    unsigned char CAREF1         : 1;  /* Comp. A Internal Reference Select 1 */
    unsigned char CARSEL         : 1;  /* Comp. A Internal Reference Enable */
    unsigned char CAEX           : 1;  /* Comp. A Exchange Inputs */
  } CACTL1_bit;
} @ 0x0059;


enum {
  CAIFG               = 0x0001,
  CAIE                = 0x0002,
  CAIES               = 0x0004,
  CAON                = 0x0008,
  CAREF0              = 0x0010,
  CAREF1              = 0x0020,
  CARSEL              = 0x0040,
  CAEX                = 0x0080,
};


__no_init volatile union
{
  unsigned char CACTL2;  /* Comparator A Control 2 */

  struct
  {
    unsigned char CAOUT          : 1;  /* Comp. A Output */
    unsigned char CAF            : 1;  /* Comp. A Enable Output Filter */
    unsigned char P2CA0          : 1;  /* Comp. A Connect External Signal to CA0 : 1 */
    unsigned char P2CA1          : 1;  /* Comp. A Connect External Signal to CA1 : 1 */
    unsigned char CACTL24        : 1;
    unsigned char CACTL25        : 1;
    unsigned char CACTL26        : 1;
    unsigned char CACTL27        : 1;
  } CACTL2_bit;
} @ 0x005A;


enum {
  CAOUT               = 0x0001,
  CAF                 = 0x0002,
  P2CA0               = 0x0004,
  P2CA1               = 0x0008,
  CACTL24             = 0x0010,
  CACTL25             = 0x0020,
  CACTL26             = 0x0040,
  CACTL27             = 0x0080,
};


__no_init volatile union
{
  unsigned char CAPD;  /* Comparator A Port Disable */

  struct
  {
    unsigned char CAPD0          : 1;  /* Comp. A Disable Input Buffer of Port Register .0 */
    unsigned char CAPD1          : 1;  /* Comp. A Disable Input Buffer of Port Register .1 */
    unsigned char CAPD2          : 1;  /* Comp. A Disable Input Buffer of Port Register .2 */
    unsigned char CAPD3          : 1;  /* Comp. A Disable Input Buffer of Port Register .3 */
    unsigned char CAPD4          : 1;  /* Comp. A Disable Input Buffer of Port Register .4 */
    unsigned char CAPD5          : 1;  /* Comp. A Disable Input Buffer of Port Register .5 */
    unsigned char CAPD6          : 1;  /* Comp. A Disable Input Buffer of Port Register .6 */
    unsigned char CAPD7          : 1;  /* Comp. A Disable Input Buffer of Port Register .7 */
  } CAPD_bit;
} @ 0x005B;


enum {
  CAPD0               = 0x0001,
  CAPD1               = 0x0002,
  CAPD2               = 0x0004,
  CAPD3               = 0x0008,
  CAPD4               = 0x0010,
  CAPD5               = 0x0020,
  CAPD6               = 0x0040,
  CAPD7               = 0x0080,
};


#define __MSP430_HAS_COMPA__       /* Definition to show that Module is available */

#define CAREF_0          (0x00)    /* Comp. A Int. Ref. Select 0 : Off */
#define CAREF_1          (0x10)    /* Comp. A Int. Ref. Select 1 : 0.25*Vcc */
#define CAREF_2          (0x20)    /* Comp. A Int. Ref. Select 2 : 0.5*Vcc */
#define CAREF_3          (0x30)    /* Comp. A Int. Ref. Select 3 : Vt*/


/*-------------------------------------------------------------------------
 *   ADC12
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short ADC12CTL0;  /* ADC12 Control 0 */

  struct
  {
    unsigned short ADC12SC       : 1;  /* ADC12 Start Conversion */
    unsigned short ENC           : 1;  /* ADC12 Enable Conversion */
    unsigned short ADC12TOVIE    : 1;  /* ADC12 Timer Overflow interrupt enable */
    unsigned short ADC12OVIE     : 1;  /* ADC12 Overflow interrupt enable */
    unsigned short ADC12ON       : 1;  /* ADC12 On/enable */
    unsigned short REFON         : 1;  /* ADC12 Reference on */
    unsigned short REF2_5V       : 1;  /* ADC12 Ref 0:1.5V / 1:2.5V */
    unsigned short MSC           : 1;  /* ADC12 Multiple SampleConversion */
    unsigned short SHT0          : 4;  /* ADC12 Sample Hold 0 */
    unsigned short SHT1          : 4;  /* ADC12 Sample Hold 1 */
  } ADC12CTL0_bit;
} @ 0x01A0;


enum {
  ADC12SC             = 0x0001,
  ENC                 = 0x0002,
  ADC12TOVIE          = 0x0004,
  ADC12OVIE           = 0x0008,
  ADC12ON             = 0x0010,
  REFON               = 0x0020,
  REF2_5V             = 0x0040,
  MSC                 = 0x0080,
  SHT0                = 0x0800,
  SHT1                = 0x8000,
};


__no_init volatile union
{
  unsigned short ADC12CTL1;  /* ADC12 Control 1 */

  struct
  {
    unsigned short ADC12BUSY     : 1;  /* ADC12 Busy */
    unsigned short CONSEQ        : 2;  /* ADC12 Conversion Sequence Select */
    unsigned short ADC12SSEL     : 2;  /* ADC12 Clock Source Select */
    unsigned short ADC12DIV      : 3;  /* ADC12 Clock Divider Select */
    unsigned short ISSH          : 1;  /* ADC12 Invert Sample Hold Signal */
    unsigned short SHP           : 1;  /* ADC12 Sample/Hold Pulse Mode */
    unsigned short SHS           : 2;  /* ADC12 Sample/Hold Source */
    unsigned short CSTARTADD     : 4;  /* ADC12 Conversion Start Address */
  } ADC12CTL1_bit;
} @ 0x01A2;


enum {
  ADC12BUSY           = 0x0001,
  CONSEQ              = 0x0004,
  ADC12SSEL           = 0x0010,
  ADC12DIV            = 0x0080,
  ISSH                = 0x0100,
  SHP                 = 0x0200,
  SHS                 = 0x0800,
  CSTARTADD           = 0x8000,
};


 /* ADC12 Interrupt Flag */
__no_init volatile unsigned short ADC12IFG @ 0x01A4;


 /* ADC12 Interrupt Enable */
__no_init volatile unsigned short ADC12IE @ 0x01A6;


 /* ADC12 Interrupt Vector Word */
__no_init volatile unsigned short ADC12IV @ 0x01A8;


 /* ADC12 Conversion Memory 0 */
__no_init volatile unsigned short ADC12MEM0 @ 0x0140;


 /* ADC12 Conversion Memory 1 */
__no_init volatile unsigned short ADC12MEM1 @ 0x0142;


