epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
 /* ADC12 Conversion Memory 2 */
__no_init volatile unsigned short ADC12MEM2 @ 0x0144;


 /* ADC12 Conversion Memory 3 */
__no_init volatile unsigned short ADC12MEM3 @ 0x0146;


 /* ADC12 Conversion Memory 4 */
__no_init volatile unsigned short ADC12MEM4 @ 0x0148;


 /* ADC12 Conversion Memory 5 */
__no_init volatile unsigned short ADC12MEM5 @ 0x014A;


 /* ADC12 Conversion Memory 6 */
__no_init volatile unsigned short ADC12MEM6 @ 0x014C;


 /* ADC12 Conversion Memory 7 */
__no_init volatile unsigned short ADC12MEM7 @ 0x014E;


 /* ADC12 Conversion Memory 8 */
__no_init volatile unsigned short ADC12MEM8 @ 0x0150;


 /* ADC12 Conversion Memory 9 */
__no_init volatile unsigned short ADC12MEM9 @ 0x0152;


 /* ADC12 Conversion Memory 10 */
__no_init volatile unsigned short ADC12MEM10 @ 0x0154;


 /* ADC12 Conversion Memory 11 */
__no_init volatile unsigned short ADC12MEM11 @ 0x0156;


 /* ADC12 Conversion Memory 12 */
__no_init volatile unsigned short ADC12MEM12 @ 0x0158;


 /* ADC12 Conversion Memory 13 */
__no_init volatile unsigned short ADC12MEM13 @ 0x015A;


 /* ADC12 Conversion Memory 14 */
__no_init volatile unsigned short ADC12MEM14 @ 0x015C;


 /* ADC12 Conversion Memory 15 */
__no_init volatile unsigned short ADC12MEM15 @ 0x015E;


__no_init volatile union
{
  unsigned char ADC12MCTL0;  /* ADC12 Memory Control 0 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL0_bit;
} @ 0x0080;


enum {
  INCH                = 0x0008,
  SREF                = 0x0040,
  EOS                 = 0x0080,
};


__no_init volatile union
{
  unsigned char ADC12MCTL1;  /* ADC12 Memory Control 1 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL1_bit;
} @ 0x0081;




__no_init volatile union
{
  unsigned char ADC12MCTL2;  /* ADC12 Memory Control 2 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL2_bit;
} @ 0x0082;




__no_init volatile union
{
  unsigned char ADC12MCTL3;  /* ADC12 Memory Control 3 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL3_bit;
} @ 0x0083;




__no_init volatile union
{
  unsigned char ADC12MCTL4;  /* ADC12 Memory Control 4 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL4_bit;
} @ 0x0084;




__no_init volatile union
{
  unsigned char ADC12MCTL5;  /* ADC12 Memory Control 5 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL5_bit;
} @ 0x0085;




__no_init volatile union
{
  unsigned char ADC12MCTL6;  /* ADC12 Memory Control 6 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL6_bit;
} @ 0x0086;




__no_init volatile union
{
  unsigned char ADC12MCTL7;  /* ADC12 Memory Control 7 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL7_bit;
} @ 0x0087;




__no_init volatile union
{
  unsigned char ADC12MCTL8;  /* ADC12 Memory Control 8 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL8_bit;
} @ 0x0088;




__no_init volatile union
{
  unsigned char ADC12MCTL9;  /* ADC12 Memory Control 9 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL9_bit;
} @ 0x0089;




__no_init volatile union
{
  unsigned char ADC12MCTL10;  /* ADC12 Memory Control 10 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL10_bit;
} @ 0x008A;




__no_init volatile union
{
  unsigned char ADC12MCTL11;  /* ADC12 Memory Control 11 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL11_bit;
} @ 0x008B;




__no_init volatile union
{
  unsigned char ADC12MCTL12;  /* ADC12 Memory Control 12 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL12_bit;
} @ 0x008C;




__no_init volatile union
{
  unsigned char ADC12MCTL13;  /* ADC12 Memory Control 13 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL13_bit;
} @ 0x008D;




__no_init volatile union
{
  unsigned char ADC12MCTL14;  /* ADC12 Memory Control 14 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL14_bit;
} @ 0x008E;




__no_init volatile union
{
  unsigned char ADC12MCTL15;  /* ADC12 Memory Control 15 */

  struct
  {
    unsigned char INCH           : 4;
    unsigned char SREF           : 3;
    unsigned char EOS            : 1;
  } ADC12MCTL15_bit;
} @ 0x008F;




#define __MSP430_HAS_ADC12__          /* Definition to show that Module is available */

#define SHT0_0        	 (0*0x100u)
#define SHT0_1        	 (1*0x100u)
#define SHT0_2        	 (2*0x100u)
#define SHT0_3        	 (3*0x100u)
#define SHT0_4        	 (4*0x100u)
#define SHT0_5        	 (5*0x100u)
#define SHT0_6        	 (6*0x100u)
#define SHT0_7        	 (7*0x100u)
#define SHT0_8        	 (8*0x100u)
#define SHT0_9        	 (9*0x100u)
#define SHT0_10       	(10*0x100u)
#define SHT0_11       	(11*0x100u)
#define SHT0_12       	(12*0x100u)
#define SHT0_13       	(13*0x100u)
#define SHT0_14       	(14*0x100u)
#define SHT0_15       	(15*0x100u)

#define SHT1_0        	 (0*0x1000u)
#define SHT1_1        	 (1*0x1000u)
#define SHT1_2        	 (2*0x1000u)
#define SHT1_3        	 (3*0x1000u)
#define SHT1_4        	 (4*0x1000u)
#define SHT1_5        	 (5*0x1000u)
#define SHT1_6        	 (6*0x1000u)
#define SHT1_7        	 (7*0x1000u)
#define SHT1_8        	 (8*0x1000u)
#define SHT1_9        	 (9*0x1000u)
#define SHT1_10       	(10*0x1000u)
#define SHT1_11       	(11*0x1000u)
#define SHT1_12       	(12*0x1000u)
#define SHT1_13       	(13*0x1000u)
#define SHT1_14       	(14*0x1000u)
#define SHT1_15       	(15*0x1000u)

#define CONSEQ_0             (0*2u)
#define CONSEQ_1             (1*2u)
#define CONSEQ_2             (2*2u)
#define CONSEQ_3             (3*2u)
#define ADC12SSEL_0          (0*8u)
#define ADC12SSEL_1          (1*8u)
#define ADC12SSEL_2          (2*8u)
#define ADC12SSEL_3          (3*8u)
#define ADC12DIV_0           (0*0x20u)
#define ADC12DIV_1           (1*0x20u)
#define ADC12DIV_2           (2*0x20u)
#define ADC12DIV_3           (3*0x20u)
#define ADC12DIV_4           (4*0x20u)
#define ADC12DIV_5           (5*0x20u)
#define ADC12DIV_6           (6*0x20u)
#define ADC12DIV_7           (7*0x20u)
#define SHS_0                (0*0x400u)
#define SHS_1                (1*0x400u)
#define SHS_2                (2*0x400u)
#define SHS_3                (3*0x400u)
#define CSTARTADD_0          (0*0x1000u)
#define CSTARTADD_1          (1*0x1000u)
#define CSTARTADD_2          (2*0x1000u)
#define CSTARTADD_3          (3*0x1000u)
#define CSTARTADD_4          (4*0x1000u)
#define CSTARTADD_5          (5*0x1000u)
#define CSTARTADD_6          (6*0x1000u)
#define CSTARTADD_7          (7*0x1000u)
#define CSTARTADD_8          (8*0x1000u)
#define CSTARTADD_9          (9*0x1000u)
#define CSTARTADD_10        (10*0x1000u)
#define CSTARTADD_11        (11*0x1000u)
#define CSTARTADD_12        (12*0x1000u)
#define CSTARTADD_13        (13*0x1000u)
#define CSTARTADD_14        (14*0x1000u)
#define CSTARTADD_15        (15*0x1000u)

#define INCH_0               (0)
#define INCH_1               (1)
#define INCH_2               (2)
#define INCH_3               (3)
#define INCH_4               (4)
#define INCH_5               (5)
#define INCH_6               (6)
#define INCH_7               (7)
#define INCH_8               (8)
#define INCH_9               (9)
#define INCH_10             (10)
#define INCH_11             (11)
#define INCH_12             (12)
#define INCH_13             (13)
#define INCH_14             (14)
#define INCH_15             (15)

