epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
#define SREF_0               (0*0x10u)
#define SREF_1               (1*0x10u)
#define SREF_2               (2*0x10u)
#define SREF_3               (3*0x10u)
#define SREF_4               (4*0x10u)
#define SREF_5               (5*0x10u)
#define SREF_6               (6*0x10u)
#define SREF_7               (7*0x10u)


/*-------------------------------------------------------------------------
 *   DAC12
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short DAC12_0CTL;  /* DAC12_0 Control */

  struct
  {
    unsigned short DAC12GRP      : 1;  /* DAC12 group */
    unsigned short DAC12ENC      : 1;  /* DAC12 enable conversion */
    unsigned short DAC12IFG      : 1;  /* DAC12 interrupt flag */
    unsigned short DAC12IE       : 1;  /* DAC12 interrupt enable */
    unsigned short DAC12DF       : 1;  /* DAC12 data format */
    unsigned short DAC12AMP0     : 1;  /* DAC12 amplifier bit 0 */
    unsigned short DAC12AMP1     : 1;  /* DAC12 amplifier bit 1 */
    unsigned short DAC12AMP2     : 1;  /* DAC12 amplifier bit 2 */
    unsigned short DAC12IR       : 1;  /* DAC12 input reference and output range */
    unsigned short DAC12CALON    : 1;  /* DAC12 calibration */
    unsigned short DAC12LSEL0    : 1;  /* DAC12 load select bit 0 */
    unsigned short DAC12LSEL1    : 1;  /* DAC12 load select bit 1 */
    unsigned short DAC12RES      : 1;  /* DAC12 resolution */
    unsigned short DAC12SREF0    : 1;  /* DAC12 reference bit 0 */
    unsigned short DAC12SREF1    : 1;  /* DAC12 reference bit 1 */
  } DAC12_0CTL_bit;
} @ 0x01C0;


enum {
  DAC12GRP            = 0x0001,
  DAC12ENC            = 0x0002,
  DAC12IFG            = 0x0004,
  DAC12IE             = 0x0008,
  DAC12DF             = 0x0010,
  DAC12AMP0           = 0x0020,
  DAC12AMP1           = 0x0040,
  DAC12AMP2           = 0x0080,
  DAC12IR             = 0x0100,
  DAC12CALON          = 0x0200,
  DAC12LSEL0          = 0x0400,
  DAC12LSEL1          = 0x0800,
  DAC12RES            = 0x1000,
  DAC12SREF0          = 0x2000,
  DAC12SREF1          = 0x4000,
};


__no_init volatile union
{
  unsigned short DAC12_1CTL;  /* DAC12_1 Control */

  struct
  {
    unsigned short DAC12GRP      : 1;  /* DAC12 group */
    unsigned short DAC12ENC      : 1;  /* DAC12 enable conversion */
    unsigned short DAC12IFG      : 1;  /* DAC12 interrupt flag */
    unsigned short DAC12IE       : 1;  /* DAC12 interrupt enable */
    unsigned short DAC12DF       : 1;  /* DAC12 data format */
    unsigned short DAC12AMP0     : 1;  /* DAC12 amplifier bit 0 */
    unsigned short DAC12AMP1     : 1;  /* DAC12 amplifier bit 1 */
    unsigned short DAC12AMP2     : 1;  /* DAC12 amplifier bit 2 */
    unsigned short DAC12IR       : 1;  /* DAC12 input reference and output range */
    unsigned short DAC12CALON    : 1;  /* DAC12 calibration */
    unsigned short DAC12LSEL0    : 1;  /* DAC12 load select bit 0 */
    unsigned short DAC12LSEL1    : 1;  /* DAC12 load select bit 1 */
    unsigned short DAC12RES      : 1;  /* DAC12 resolution */
    unsigned short DAC12SREF0    : 1;  /* DAC12 reference bit 0 */
    unsigned short DAC12SREF1    : 1;  /* DAC12 reference bit 1 */
  } DAC12_1CTL_bit;
} @ 0x01C2;




 /* DAC12_0 Data */
__no_init volatile unsigned short DAC12_0DAT @ 0x01C8;


 /* DAC12_1 Data */
__no_init volatile unsigned short DAC12_1DAT @ 0x01CA;


#define __MSP430_HAS_DAC12_2__       /* Definition to show that Module is available */

#define DAC12AMP_0      (0*0x0020u)  /* DAC12 amplifier 0: off,    3-state */
#define DAC12AMP_1      (1*0x0020u)  /* DAC12 amplifier 1: off,    off */
#define DAC12AMP_2      (2*0x0020u)  /* DAC12 amplifier 2: low,    low */
#define DAC12AMP_3      (3*0x0020u)  /* DAC12 amplifier 3: low,    medium */
#define DAC12AMP_4      (4*0x0020u)  /* DAC12 amplifier 4: low,    high */
#define DAC12AMP_5      (5*0x0020u)  /* DAC12 amplifier 5: medium, medium */
#define DAC12AMP_6      (6*0x0020u)  /* DAC12 amplifier 6: medium, high */
#define DAC12AMP_7      (7*0x0020u)  /* DAC12 amplifier 7: high,   high */

#define DAC12LSEL_0     (0*0x0400u)  /* DAC12 load select 0: direct */
#define DAC12LSEL_1     (1*0x0400u)  /* DAC12 load select 1: latched with DAT */
#define DAC12LSEL_2     (2*0x0400u)  /* DAC12 load select 2: latched with pos. Timer_A3.OUT1 */
#define DAC12LSEL_3     (3*0x0400u)  /* DAC12 load select 3: latched with pos. Timer_B7.OUT1 */

#define DAC12SREF_0     (0*0x2000u)  /* DAC12 reference 0: Vref+ */
#define DAC12SREF_1     (1*0x2000u)  /* DAC12 reference 1: Vref+ */
#define DAC12SREF_2     (2*0x2000u)  /* DAC12 reference 2: Veref+ */
#define DAC12SREF_3     (3*0x2000u)  /* DAC12 reference 3: Veref+ */


/*-------------------------------------------------------------------------
 *   DMA
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short DMACTL0;  /* DMA Module Control 0 */

  struct
  {
    unsigned short DMA0TSEL0     : 1;  /* DMA channel 0 transfer select bit 0 */
    unsigned short DMA0TSEL1     : 1;  /* DMA channel 0 transfer select bit 1 */
    unsigned short DMA0TSEL2     : 1;  /* DMA channel 0 transfer select bit 2 */
    unsigned short DMA0TSEL3     : 1;  /* DMA channel 0 transfer select bit 3 */
    unsigned short DMA1TSEL0     : 1;  /* DMA channel 1 transfer select bit 0 */
    unsigned short DMA1TSEL1     : 1;  /* DMA channel 1 transfer select bit 1 */
    unsigned short DMA1TSEL2     : 1;  /* DMA channel 1 transfer select bit 2 */
    unsigned short DMA1TSEL3     : 1;  /* DMA channel 1 transfer select bit 3 */
    unsigned short DMA2TSEL0     : 1;  /* DMA channel 2 transfer select bit 0 */
    unsigned short DMA2TSEL1     : 1;  /* DMA channel 2 transfer select bit 1 */
    unsigned short DMA2TSEL2     : 1;  /* DMA channel 2 transfer select bit 2 */
    unsigned short DMA2TSEL3     : 1;  /* DMA channel 2 transfer select bit 3 */
  } DMACTL0_bit;
} @ 0x0122;


enum {
  DMA0TSEL0           = 0x0001,
  DMA0TSEL1           = 0x0002,
  DMA0TSEL2           = 0x0004,
  DMA0TSEL3           = 0x0008,
  DMA1TSEL0           = 0x0010,
  DMA1TSEL1           = 0x0020,
  DMA1TSEL2           = 0x0040,
  DMA1TSEL3           = 0x0080,
  DMA2TSEL0           = 0x0100,
  DMA2TSEL1           = 0x0200,
  DMA2TSEL2           = 0x0400,
  DMA2TSEL3           = 0x0800,
};


