epcbtech/ak-base-kit-stm32l151/application/sources/networks/mbmaster-v2.9.6/demo/MSP430/System/io430x16xm.h
__no_init volatile union
{
  unsigned short DMACTL1;  /* DMA Module Control 1 */

  struct
  {
    unsigned short ENNMI         : 1;  /* Enable NMI interruption of DMA */
    unsigned short ROUNDROBIN    : 1;  /* Round-Robin DMA channel priorities */
    unsigned short DMAONFETCH    : 1;  /* DMA transfer on instruction fetch */
  } DMACTL1_bit;
} @ 0x0124;


enum {
  ENNMI               = 0x0001,
  ROUNDROBIN          = 0x0002,
  DMAONFETCH          = 0x0004,
};


__no_init volatile union
{
  unsigned short DMA0CTL;  /* DMA Channel 0 Control */

  struct
  {
    unsigned short DMAREQ        : 1;  /* Initiate DMA transfer with DMATSEL */
    unsigned short DMAABORT      : 1;  /* DMA transfer aborted by NMI */
    unsigned short DMAIE         : 1;  /* DMA interrupt enable */
    unsigned short DMAIFG        : 1;  /* DMA interrupt flag */
    unsigned short DMAEN         : 1;  /* DMA enable */
    unsigned short DMALEVEL      : 1;  /* DMA level sensitive trigger select */
    unsigned short DMASRCBYTE    : 1;  /* DMA source byte */
    unsigned short DMADSTBYTE    : 1;  /* DMA destination byte */
    unsigned short DMASRCINCR0   : 1;  /* DMA source increment bit 0 */
    unsigned short DMASRCINCR1   : 1;  /* DMA source increment bit 1 */
    unsigned short DMADSTINCR0   : 1;  /* DMA destination increment bit 0 */
    unsigned short DMADSTINCR1   : 1;  /* DMA destination increment bit 1 */
    unsigned short DMADT0        : 1;  /* DMA transfer mode bit 0 */
    unsigned short DMADT1        : 1;  /* DMA transfer mode bit 1 */
    unsigned short DMADT2        : 1;  /* DMA transfer mode bit 2 */
  } DMA0CTL_bit;
} @ 0x01E0;


enum {
  DMAREQ              = 0x0001,
  DMAABORT            = 0x0002,
  DMAIE               = 0x0004,
  DMAIFG              = 0x0008,
  DMAEN               = 0x0010,
  DMALEVEL            = 0x0020,
  DMASRCBYTE          = 0x0040,
  DMADSTBYTE          = 0x0080,
  DMASRCINCR0         = 0x0100,
  DMASRCINCR1         = 0x0200,
  DMADSTINCR0         = 0x0400,
  DMADSTINCR1         = 0x0800,
  DMADT0              = 0x1000,
  DMADT1              = 0x2000,
  DMADT2              = 0x4000,
};


__no_init volatile union
{
  unsigned short DMA1CTL;  /* DMA Channel 1 Control */

  struct
  {
    unsigned short DMAREQ        : 1;  /* Initiate DMA transfer with DMATSEL */
    unsigned short DMAABORT      : 1;  /* DMA transfer aborted by NMI */
    unsigned short DMAIE         : 1;  /* DMA interrupt enable */
    unsigned short DMAIFG        : 1;  /* DMA interrupt flag */
    unsigned short DMAEN         : 1;  /* DMA enable */
    unsigned short DMALEVEL      : 1;  /* DMA level sensitive trigger select */
    unsigned short DMASRCBYTE    : 1;  /* DMA source byte */
    unsigned short DMADSTBYTE    : 1;  /* DMA destination byte */
    unsigned short DMASRCINCR0   : 1;  /* DMA source increment bit 0 */
    unsigned short DMASRCINCR1   : 1;  /* DMA source increment bit 1 */
    unsigned short DMADSTINCR0   : 1;  /* DMA destination increment bit 0 */
    unsigned short DMADSTINCR1   : 1;  /* DMA destination increment bit 1 */
    unsigned short DMADT0        : 1;  /* DMA transfer mode bit 0 */
    unsigned short DMADT1        : 1;  /* DMA transfer mode bit 1 */
    unsigned short DMADT2        : 1;  /* DMA transfer mode bit 2 */
  } DMA1CTL_bit;
} @ 0x01E8;




__no_init volatile union
{
  unsigned short DMA2CTL;  /* DMA Channel 2 Control */

  struct
  {
    unsigned short DMAREQ        : 1;  /* Initiate DMA transfer with DMATSEL */
    unsigned short DMAABORT      : 1;  /* DMA transfer aborted by NMI */
    unsigned short DMAIE         : 1;  /* DMA interrupt enable */
    unsigned short DMAIFG        : 1;  /* DMA interrupt flag */
    unsigned short DMAEN         : 1;  /* DMA enable */
    unsigned short DMALEVEL      : 1;  /* DMA level sensitive trigger select */
    unsigned short DMASRCBYTE    : 1;  /* DMA source byte */
    unsigned short DMADSTBYTE    : 1;  /* DMA destination byte */
    unsigned short DMASRCINCR0   : 1;  /* DMA source increment bit 0 */
    unsigned short DMASRCINCR1   : 1;  /* DMA source increment bit 1 */
    unsigned short DMADSTINCR0   : 1;  /* DMA destination increment bit 0 */
    unsigned short DMADSTINCR1   : 1;  /* DMA destination increment bit 1 */
    unsigned short DMADT0        : 1;  /* DMA transfer mode bit 0 */
    unsigned short DMADT1        : 1;  /* DMA transfer mode bit 1 */
    unsigned short DMADT2        : 1;  /* DMA transfer mode bit 2 */
  } DMA2CTL_bit;
} @ 0x01F0;




 /* DMA Channel 0 Source Address */
__no_init volatile unsigned short DMA0SA @ 0x01E2;


 /* DMA Channel 0 Destination Address */
__no_init volatile unsigned short DMA0DA @ 0x01E4;


 /* DMA Channel 0 Transfer Size */
__no_init volatile unsigned short DMA0SZ @ 0x01E6;


 /* DMA Channel 1 Source Address */
__no_init volatile unsigned short DMA1SA @ 0x01EA;


 /* DMA Channel 1 Destination Address */
__no_init volatile unsigned short DMA1DA @ 0x01EC;


 /* DMA Channel 1 Transfer Size */
__no_init volatile unsigned short DMA1SZ @ 0x01EE;


 /* DMA Channel 2 Source Address */
__no_init volatile unsigned short DMA2SA @ 0x01F2;


 /* DMA Channel 2 Destination Address */
__no_init volatile unsigned short DMA2DA @ 0x01F4;


 /* DMA Channel 2 Transfer Size */
__no_init volatile unsigned short DMA2SZ @ 0x01F6;


#define __MSP430_HAS_DMA_3__         /* Definition to show that Module is available */

#define DMA0TSEL_0      (0*0x0001u)  /* DMA channel 0 transfer select 0:  DMA_REQ (sw)*/
#define DMA0TSEL_1      (1*0x0001u)  /* DMA channel 0 transfer select 1:  Timer_A (TACCR2.IFG) */
#define DMA0TSEL_2      (2*0x0001u)  /* DMA channel 0 transfer select 2:  Timer_B (TBCCR2.IFG) */
#define DMA0TSEL_3      (3*0x0001u)  /* DMA channel 0 transfer select 3:  I2C receive */
#define DMA0TSEL_4      (4*0x0001u)  /* DMA channel 0 transfer select 4:  I2C transmit */
#define DMA0TSEL_5      (5*0x0001u)  /* DMA channel 0 transfer select 5:  DAC12_0CTL.DAC12IFG */
#define DMA0TSEL_6      (6*0x0001u)  /* DMA channel 0 transfer select 6:  ADC12 (ADC12IFG) */
#define DMA0TSEL_14     (14*0x0001u) /* DMA channel 0 transfer select 14: previous DMA channel DMA2IFG */
#define DMA0TSEL_15     (15*0x0001u) /* DMA channel 0 transfer select 15: ext. Trigger (DMAE0) */

#define DMA1TSEL_0      (0*0x0010u)  /* DMA channel 1 transfer select 0:  DMA_REQ */
#define DMA1TSEL_1      (1*0x0010u)  /* DMA channel 1 transfer select 1:  Timer_A CCRIFG.2 */
#define DMA1TSEL_2      (2*0x0010u)  /* DMA channel 1 transfer select 2:  Timer_B CCRIFG.2 */
#define DMA1TSEL_3      (3*0x0010u)  /* DMA channel 1 transfer select 3:  I2C receive */
#define DMA1TSEL_4      (4*0x0010u)  /* DMA channel 1 transfer select 4:  I2C transmit */
#define DMA1TSEL_5      (5*0x0010u)  /* DMA channel 1 transfer select 5:  DAC12.0IFG */
#define DMA1TSEL_6      (6*0x0010u)  /* DMA channel 1 transfer select 6:  ADC12 (ADC12IFG) */
#define DMA1TSEL_14     (14*0x0010u) /* DMA channel 1 transfer select 14: previous DMA channel DMA0IFG */
#define DMA1TSEL_15     (15*0x0010u) /* DMA channel 1 transfer select 15: ext. Trigger (DMAE0) */

#define DMA2TSEL_0      (0*0x0100u)  /* DMA channel 2 transfer select 0:  DMA_REQ */
#define DMA2TSEL_1      (1*0x0100u)  /* DMA channel 2 transfer select 1:  Timer_A CCRIFG.2 */
#define DMA2TSEL_2      (2*0x0100u)  /* DMA channel 2 transfer select 2:  Timer_B CCRIFG.2 */
#define DMA2TSEL_3      (3*0x0100u)  /* DMA channel 2 transfer select 3:  I2C receive */
#define DMA2TSEL_4      (4*0x0100u)  /* DMA channel 2 transfer select 4:  I2C transmit */
#define DMA2TSEL_5      (5*0x0100u)  /* DMA channel 2 transfer select 5:  DAC12.0IFG */
#define DMA2TSEL_6      (6*0x0100u)  /* DMA channel 2 transfer select 6:  ADC12 (ADC12IFG) */
#define DMA2TSEL_14     (14*0x0100u) /* DMA channel 2 transfer select 14: previous DMA channel DMA1IFG */
#define DMA2TSEL_15     (15*0x0100u) /* DMA channel 2 transfer select 15: ext. Trigger (DMAE0) */

#define DMASWDW         (0*0x0040u)  /* DMA transfer: source word to destination word */
#define DMASBDW         (1*0x0040u)  /* DMA transfer: source byte to destination word */
#define DMASWDB         (2*0x0040u)  /* DMA transfer: source word to destination byte */
#define DMASBDB         (3*0x0040u)  /* DMA transfer: source byte to destination byte */

#define DMASRCINCR_0    (0*0x0100u)  /* DMA source increment 0: source address unchanged */
#define DMASRCINCR_1    (1*0x0100u)  /* DMA source increment 1: source address unchanged */
#define DMASRCINCR_2    (2*0x0100u)  /* DMA source increment 2: source address decremented */
#define DMASRCINCR_3    (3*0x0100u)  /* DMA source increment 3: source address incremented */

#define DMADSTINCR_0    (0*0x0400u)  /* DMA destination increment 0: destination address unchanged */
#define DMADSTINCR_1    (1*0x0400u)  /* DMA destination increment 1: destination address unchanged */
#define DMADSTINCR_2    (2*0x0400u)  /* DMA destination increment 2: destination address decremented */
#define DMADSTINCR_3    (3*0x0400u)  /* DMA destination increment 3: destination address incremented */

